Revit 2027 API
AnalyticalLink.StartHubId Property
 Hub ID at start of AnalyticalLink.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId StartHubId { get; }
Public ReadOnly Property StartHubId As ElementId
	Get
public:
property ElementId^ StartHubId {
	ElementId^ get ();
}
member StartHubId : ElementId with get
Property Value
ElementId
See Also
Reference
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace